# -*- coding: utf-8 -*-

import pandas as pd
from konlpy.tag import Twitter
from collections import Counter
from ckonlpy.tag import Twitter

def noun_count(file_name):
    f = open("C:/Users/leevi/Desktop/%s.txt" % (file_name), 'r', encoding='UTF8')
    text = f.read()
    twitter = Twitter()
    twitter.add_dictionary(['코스미', '코스미콘테스트', '코스미화이팅','sk2','SK2' 'sk','SK','mac','MAC','motd','MOTD','atb', 'ATB', '뷰티G', '3ce','3CE', 'mlbb', '코스미','보습','향수','메이크업','립스틱','틴트','핸드크림','수분','이니스프리','크림','코스미콘테스트','로션','마스크팩','수분크림','립밤','샴푸','코스미화이팅','에센스','선크림','바디로션','섀도우','스킨','바디워시','파운데이션','토너','미스트','미백','틴트추천','향수추천','블러셔','립스틱추천','쿠션','추천','클렌징','올리브영','더페이스샵','에뛰드하우스','맞추','썬크림','클렌징폼','페리페라','촉촉','인생뷰티템','미샤','주름개선','헤어에센스','토니모리','치약','세럼','헤라','아이크림','아이섀도우','입생로랑','아리따움','에뛰드','오일','헤어','마스카라','남자향수','여드름','폼클렌징','삐아','트리트먼트','스킨케어','샤넬','화장품','마몽드','아이메이크업','섀도우추천','니베아','가을스킨케어팁','가성비','아이라이너','각질제거','올인원','러쉬','비비크림','클리오','바디미스트','해피바스','인생템','파우더','앰플','시드물','피부','데일리메이크업','네이처리퍼블릭','아이오페','록시땅','피부진정','건성','디올','뷰티','데일리','컨실러','보습크림','블러셔추천','립틴트','클렌징오일','스킨푸드','섀도우팔레트','설화수','알로에','쿠션추천','바세린','자외선차단','트러블','립추천','더샘','클렌징워터','아이브로우','비누','촉촉함','프라이머','여자향수','마스크','에스티로더','건조','닥터지','맞팔','왁스','베네피트','더바디샵','비욘드','모공','애터미','수딩젤','가을립','피부관리','닥터자르트','선스틱','좋아요','바비브라운','온더바디','진정','맥립스틱','저자극','탈모','어퓨','팩트','주름','남자','피지오겔','코스모','블랙헤드','AHC','뉴트로지나','아벤느','민감성','스킨로션','가을메이크업','스프레이','남자화장품','프리메라','지속력','메디힐','키엘','각질','클렌저','세안','나스','가을','아모스','피지','베이스','바디','랑콤','스크럽','미장센','영양크림','글리터','라네즈','눈화장','남성화장품','코팩','향기','리무버','헤어오일','센카','키스미','조말론','바이오더마','크리니크','필링젤','바디크림','매트립','레드립','미쟝센','남성','투쿨포스쿨','MAC','추천템','로레알','핸드워시','홀리카홀리카','지성','ATB','달팽이크림','컨디셔너','하이라이터','MOTD','탄력','웨이크메이크','비오템','다이소','세타필','네일','영양','데오드란트','입술','카밀','강추','블리블리','쉐딩','톤업크림','히말라야','린스','안티에이징','모발','버츠비','식물나라','미백크림','불가리','유리아쥬','화이트닝','차앤박','이글립스','웜톤','워터프루프','섬유향수','두피','바디오일','티트리','슈에무라','그린티','케라시스','마녀공장','기초','콜라겐','벨벳틴트','재생크림','motd','시세이도','수분공급','파데','렌즈','가성비갑','헤어팩','뷰티G','엘라스틴','아토피','자외선','파우치공개','바디스크럽','저렴이','릴리바이레드','랩시리즈','에스쁘아','노세범','팔레트','슈렉팩','프로폴리스','한율','다둥이_아빠','코랄','스와니코코','라로슈포제','필링','수면팩','탈모샴푸','헤어미스트','민감성피부','블랙루즈','아모레퍼시픽','건성피부','슬리핑팩','퍼퓸','일리윤','옴므','썬스틱','커버력','립글로즈','코스미짱','핑크','립밤추천','3ce','스틸라','오휘','커버','렌즈추천','세안제','존바바토스','립케어','페이스오일','랑방','말린장미','리리코스','빌리프','퍼펙트휩','바닐라코','mlbb','아이소이','모공관리','비비','대용량','화이트머스크','톤업','샤워젤','비타민','앙씽','선물','Aesop','AHC','All_Skin','Aloe','APIEU','AQVA','ARMANI','Atomy','Aveda','Aveeno','Avene','BB','BB크림','Becca','benefit','BEYOND','Bioderma','blusher','Boh','Bomb','Bonbons','BONIBINO','BOSCP','BOSOd','Boss','Botanic','Botanica','bourjois','BP크림','BRTC','BRTC아이크림','BRTC팩','bsight','bt21','BTS','BTS에디션','BTS팩트','Buberry','Bulgari','bulldog','Burberry','Burts','burtsbee','CC크림','CC','CNP마스크','Cnp','CNP','DHC','DIY','DPC','Dove','Dr_Jart','DrG','GUCCI','handmade','IOPE','KATE','KENZO','LG','Lipbam','Lips','MOTT','M자','Nars','NIVEA','Ph','PH','px','PX','T존','Y존케어','U존','UV쿠션','UV크림','ZARA','ZEAL','Zerogram','ZEROID','Ziaja','zoazoa','zuma','ZZ크림'], 'Noun')
    nouns = twitter.nouns(text)
    count = Counter(nouns)

    a = []
    b = []
    for k in count.items():
        a.append(k[0])
        b.append(k[1])

    df1 = pd.DataFrame({'단어': a, '빈도수': b})
    df1 = df1.sort_values(by='빈도수', ascending=False)
    print(df1)
    df1.to_excel('C:/Users/leevi/Desktop/%s_noun_count.xlsx' %(file_name), index=False)


def main():
    # file_name = ''
    file_name_list = ['test11', 'test16', 'test21', 'test26', 'test31', 'test36', 'test41', 'test46', 'test51', 'test56', 'test61']
    for file_name in file_name_list:
        noun_count(file_name)
        print('저장완료')


if __name__ == "__main__":
    main()


